package com.questionnaire.services;

public class Test {
    public static void main(String[] args) {
        String str = "“राष्ट्रीय फोरेंसिक इन् फ्रास्ट्र क्चर एन्हां समेंट य ोजना” के संदर्भ में निम्नलिखि त कथनों पर वि चार करें।\n" +
                "                  1. प्रधानमंत्री की अध्यक्षता में कें द्रीय मंत्रि मंडल ने कें द्रीय योजना र ाष्ट्रीय फोरेंसिक इन्फ्रास्ट्र चर एन्हा समेंट य ोजना\n" +
                "                  (NFIES) के लि ए गृह मंत्रालय के प्रस्ताव को मंजूरी दी।\n" +
                "                  2. इस य ोजना का उद्देश्य 28 र ाज्यों और सभी कें द्र\u200Dशासित\n" +
                "                  प्रदेशों में र ाष्ट्रीय सीबीआई वि ज्ञान वि श्ववि द्यालय की\n" +
                "                  आॅफ कैं पस प्रयोगशालाऍं स्थापि त करके सम्पूर्ण देश में\n" +
                "                  फारेंस्सि\u200Dक वि ज्ञान प्रयोगशालाऍं को शामि ल करना ह ै।\n" +
                "                  3. इस य ोजना का वर्ष 2024-26 से 2028-30 तक ह ै।\n" +
                "                  उपर्युक्त कथनों में से कौन से सही ह ै।";

        System.out.println(str.length());
    }
}
